Revit 2027 API
OverrideGraphicSettings.SetSurfaceTransparency Method
 Sets the projection surface transparency.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetSurfaceTransparency(
	int transparency
)
Public Function SetSurfaceTransparency (
	transparency As Integer
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetSurfaceTransparency(
	int transparency
)
member SetSurfaceTransparency :
        transparency : int -> OverrideGraphicSettings
Parameters
transparency Int32
 Value of the transparency of the projection surface (0 = opaque, 100 = fully transparent).
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentException |  Transparency must be greater than 0 and less than 100.
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace